```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_lxc.new will be created
  + resource "proxmox_lxc" "new" {
      + arch         = "amd64"
      + cmode        = "tty"
      + console      = true
      + cpulimit     = 0
      + cpuunits     = 1024
      + hostname     = "terraform-new-container"
      + id           = (known after apply)
      + memory       = 512
      + onboot       = false
      + ostemplate   = "local/ubuntu-20.04-standard_20.04-1_amd64.tar.gz"
      + ostype       = (known after apply)
      + password     = (sensitive value)
      + protection   = false
      + start        = false
      + swap         = 512
      + target_node  = "Aphrodite"
      + tty          = 2
      + unprivileged = true
      + vmid         = 0

      + features {
          + nesting = true
        }

      + network {
          + bridge = "vmbr0"
          + hwaddr = (known after apply)
          + ip     = "dhcp"
          + ip6    = "dhcp"
          + name   = "eth0"
          + tag    = (known after apply)
          + trunks = (known after apply)
          + type   = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

proxmox_lxc.new: Creating...

Error: rpc error: code = Unavailable desc = transport is closing
```

`panic: runtime error: index out of range [0] with length 0
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5:
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: goroutine 68 [running]:
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/Telmate/terraform-provider-proxmox/proxmox.resourceLxcCreate(0xc000171280, 0xb486e0, 0xc0005ccc80, 0x0, 0x0)
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/Telmate/terraform-provider-proxmox/proxmox/resource_lxc.go:441 +0x12cd
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).create(0xc00031cc60, 0xdb4ea0, 0xc0005cb740, 0xc000171280, 0xb486e0, 0xc0005ccc80, 0x0, 0x0, 0x0)
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/hashicorp/terraform-plugin-sdk/v2@v2.1.0/helper/schema/resource.go:268 +0x88
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/hashicorp/terraform-plugin-sdk/v2/helper/schema.(*Resource).Apply(0xc00031cc60, 0xdb4ea0, 0xc0005cb740, 0xc0005d6930, 0xc0004d96a0, 0xb486e0, 0xc0005ccc80, 0x0, 0x0, 0x0, ...)
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/hashicorp/terraform-plugin-sdk/v2@v2.1.0/helper/schema/resource.go:386 +0x681
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/hashicorp/terraform-plugin-sdk/v2/internal/helper/plugin.(*GRPCProviderServer).ApplyResourceChange(0xc00030e240, 0xdb4ea0, 0xc0005cb740, 0xc0005d6700, 0xc00030e240, 0xc00030e250, 0xcc0370)
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/hashicorp/terraform-plugin-sdk/v2@v2.1.0/internal/helper/plugin/grpc_provider.go:952 +0x8b2
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/hashicorp/terraform-plugin-sdk/v2/internal/tfplugin5._Provider_ApplyResourceChange_Handler.func1(0xdb4ea0, 0xc0005cb740, 0xc51e20, 0xc0005d6700, 0xc0005cb740, 0xbd4d20, 0xc000042701, 0xc0004d8c20)
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/hashicorp/terraform-plugin-sdk/v2@v2.1.0/internal/tfplugin5/tfplugin5.pb.go:3312 +0x86
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/hashicorp/terraform-plugin-sdk/v2/plugin.Serve.func3.1(0xdb4f60, 0xc0003c2570, 0xc51e20, 0xc0005d6700, 0xc0004d8c00, 0xc0004d8c20, 0xc000775ba0, 0x585e28, 0xc2a1e0, 0xc0003c2570)
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/hashicorp/terraform-plugin-sdk/v2@v2.1.0/plugin/serve.go:76 +0x87
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: github.com/hashicorp/terraform-plugin-sdk/v2/internal/tfplugin5._Provider_ApplyResourceChange_Handler(0xc600a0, 0xc00030e240, 0xdb4f60, 0xc0003c2570, 0xc000042720, 0xc0000ad900, 0xdb4f60, 0xc0003c2570, 0xc0005f2a00, 0x4f9)
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	github.com/hashicorp/terraform-plugin-sdk/v2@v2.1.0/internal/tfplugin5/tfplugin5.pb.go:3314 +0x14b
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: google.golang.org/grpc.(*Server).processUnaryRPC(0xc000340380, 0xdbda80, 0xc000500480, 0xc00017e000, 0xc00069c030, 0x12e0820, 0x0, 0x0, 0x0)
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	google.golang.org/grpc@v1.30.0/server.go:1171 +0x50a
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: google.golang.org/grpc.(*Server).handleStream(0xc000340380, 0xdbda80, 0xc000500480, 0xc00017e000, 0x0)
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	google.golang.org/grpc@v1.30.0/server.go:1494 +0xccd
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: google.golang.org/grpc.(*Server).serveStreams.func1.2(0xc00050a1b0, 0xc000340380, 0xdbda80, 0xc000500480, 0xc00017e000)
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	google.golang.org/grpc@v1.30.0/server.go:834 +0xa1
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: created by google.golang.org/grpc.(*Server).serveStreams.func1
2020-11-28T21:27:59.549-0600 [DEBUG] plugin.terraform-provider-proxmox_v2.6.5: 	google.golang.org/grpc@v1.30.0/server.go:832 +0x204
2020-11-28T21:27:59.550-0600 [DEBUG] plugin: plugin process exited: path=.terraform/plugins/registry.terraform.io/telmate/proxmox/2.6.5/linux_amd64/terraform-provider-proxmox_v2.6.5 pid=1248 error="exit status 2"
2020/11/28 21:27:59 [DEBUG] proxmox_lxc.new: apply errored, but we're indicating that via the Error pointer rather than returning it: rpc error: code = Unavailable desc = transport is closing
2020/11/28 21:27:59 [TRACE] eval: *terraform.EvalMaybeTainted
2020/11/28 21:27:59 [TRACE] EvalMaybeTainted: proxmox_lxc.new encountered an error during creation, so it is now marked as tainted
2020/11/28 21:27:59 [TRACE] eval: *terraform.EvalWriteState
2020/11/28 21:27:59 [TRACE] EvalWriteState: removing state object for proxmox_lxc.new
2020/11/28 21:27:59 [TRACE] eval: *terraform.EvalApplyProvisioners
2020/11/28 21:27:59 [TRACE] EvalApplyProvisioners: proxmox_lxc.new has no state, so skipping provisioners
2020/11/28 21:27:59 [TRACE] eval: *terraform.EvalMaybeTainted
2020/11/28 21:27:59 [TRACE] EvalMaybeTainted: proxmox_lxc.new encountered an error during creation, so it is now marked as tainted
2020/11/28 21:27:59 [TRACE] eval: *terraform.EvalWriteState
2020/11/28 21:27:59 [TRACE] EvalWriteState: removing state object for proxmox_lxc.new
2020/11/28 21:27:59 [TRACE] eval: *terraform.EvalIf
2020/11/28 21:27:59 [TRACE] eval: *terraform.EvalIf
2020/11/28 21:27:59 [TRACE] eval: *terraform.EvalWriteDiff
2020/11/28 21:27:59 [TRACE] eval: *terraform.EvalApplyPost
2020/11/28 21:27:59 [ERROR] eval: *terraform.EvalApplyPost, err: rpc error: code = Unavailable desc = transport is closing
2020-11-28T21:27:59.550-0600 [WARN]  plugin.stdio: received EOF, stopping recv loop: err="rpc error: code = Unavailable desc = transport is closing"
2020/11/28 21:27:59 [ERROR] eval: *terraform.EvalSequence, err: rpc error: code = Unavailable desc = transport is closing
2020/11/28 21:27:59 [TRACE] [walkApply] Exiting eval tree: proxmox_lxc.new
2020/11/28 21:27:59 [TRACE] vertex "proxmox_lxc.new": visit complete
2020/11/28 21:27:59 [TRACE] dag/walk: upstream of "provider[\"registry.terraform.io/telmate/proxmox\"] (close)" errored, so skipping
2020/11/28 21:27:59 [TRACE] dag/walk: upstream of "meta.count-boundary (EachMode fixup)" errored, so skipping
2020/11/28 21:27:59 [TRACE] dag/walk: upstream of "root" errored, so skipping
2020/11/28 21:27:59 [TRACE] statemgr.Filesystem: not making a backup, because the new snapshot is identical to the old
2020/11/28 21:27:59 [TRACE] statemgr.Filesystem: no state changes since last snapshot
2020/11/28 21:27:59 [TRACE] statemgr.Filesystem: writing snapshot at terraform.tfstate
2020/11/28 21:27:59 [TRACE] statemgr.Filesystem: removing lock metadata file .terraform.tfstate.lock.info
2020/11/28 21:27:59 [TRACE] statemgr.Filesystem: unlocking terraform.tfstate using fcntl flock
2020-11-28T21:27:59.556-0600 [DEBUG] plugin: plugin exited`